app/controllers/users_controller.rb

 def create
    User.create(user_params)
---
INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ko"], ["age", 47], ["created_at", "2020-05-31 01:16:05.967194"], ["updated_at", "2020-05-31 01:16:05.967194"]]

def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "kosa"], ["updated_at", "2020-05-09 16:12:09.687779"], ["id", 3]]